passengers = [
    {
        "место": 0,
        "имя": "Питонов Василий Аспидович",
        "проверен": False,
        "ручная кладь": ["ноутбук", "наушники"]
    },
    {
        "место": 1,
        "имя": "Блинохватов Прохор Аскольдович",
        "проверен": False,
        "ручная кладь": ["книга", "четки", "беруши"]
    },
    {
        "место": 2,
        "имя": "Бабахин Капитон Кондратьевич",
        "проверен": False,
        "ручная кладь": ["семечки", "граната", "кепка"]
    },
    {
        "место": 3,
        "имя": "Бескровная Таисия Ипатовна",
        "проверен": False,
        "ручная кладь": ["журнал", "букет", "горсть земли"]
    },
    {
        "место": 4,
        "имя": "Аскетов Демьян Захарьевич",
        "проверен": False,
        "ручная кладь": []
    }
]

print('пассажиров на борту: ', len(passengers))
banned_items = ['нож', 'бензин', 'граната', 'пистолет']
allowed_passagers = 0

for passenger in passengers:
    banned_items_counter = 0
    for item in passenger['ручная кладь']:
        if item in banned_items:
            print('В ручной клади пассажира', passenger['имя'], 'обнаружен запрещенный предмет', item, '. Пассажир не допущен к вылету.')
            banned_items_counter += 1
            break
    if not banned_items_counter:
        allowed_passagers += 1
        print('Пассажир', passenger['имя'], 'допущен к вылету')
            
print(f'допущенно к вылету пасажиров: {allowed_passagers}')
